src/main/test/supply-chain/4-Finalization/0-Apply Tax/0-Tax Registration Number/3-TC02.02.03_40_TaxRepresentative_Address/3-ST_PTE_TC02.02.03_40_TaxRepresentative_Address_2_apply_FixedPrice/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <arg0>
            <DocumentId>
               <SystemSourceId>ICI001</SystemSourceId>
               <TransactionId/>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>CustomField1</CustomField1>
               <CustomField2/>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10/>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
  
            <PriceType>fixed</PriceType>
            <CalculationDecimalPlaces>2</CalculationDecimalPlaces>
            <PreviousInvoiceTaxCountry/>
            <TaxDecisionSet>
               <TaxDecisionSetId/>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation/>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </SellerTaxIndicator>
               <SellerTaxCountry/>
               <SellerTaxState/>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation/>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry/>
               <BuyerTaxState/>
               <CombinedTaxIndicator/>
               <CommercialIndicator/>
               <SellerTaxRegCountry/>
               <SellerTaxRegState/>
               <BuyerTaxRegCountry/>
               <BuyerTaxRegState/>
	              <GrossPriceCountry/>

               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>

     	            <SellerLocalTaxCurrencyCode/>     
  
	                 <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>1</ItemNo>
                  <ItemType/>
                  <UNSPSC>10200000</UNSPSC>
                  <Classification/>
                  <SubClassification/>
                  <CountryItemClassification/>
                  <GrossAmount>12.10</GrossAmount>
                  <VariableTaxSteeringInput>

                     <ConsignorCountry/>
                     <ConsignorState/>

                     <ConsignorBusinessUnitCode/>

                     <ConsignorBusinessUnitType/>

                     <ConsigneeCountry/>

                     <ConsigneeState/>

                     <ConsigneeBusinessUnitCode/>

                     <ConsigneeBusinessUnitType/>

                     <CarrierCountry/>

                     <CarrierState/>

                     <CarrierBusinessUnitCode/>

                     <CarrierBusinessUnitType/>

                     <ShipmentStartCountry/>

                     <ShipmentEndCountry/>

                     <ShipmentStartState/>

                     <ShipmentEndState/>

                     <ServiceRenderedCountry/>

                     <ServiceRenderedState/>

                     <ResalePurpose/>

                     <IsOutBonded/>

                     <IsInBonded/>

                     <TaxPreAlgorithmOutput>

                        <IsExport/>

                        <IsImport/>

                        <IsExported/>

                        <IsImported/>

                     </TaxPreAlgorithmOutput>

                     <ShippingOfCustomsClearedGoods/>

                  </VariableTaxSteeringInput>
               </TaxInvoiceLine>
               <TaxInvoiceLine>
                  <LineNumber>2</LineNumber>
                  <ItemNo>2</ItemNo>
                  <ItemType/>
                  <UNSPSC>10203000</UNSPSC>
                  <Classification/>
                  <SubClassification/>
                  <CountryItemClassification/>
                  <GrossAmount>12.26</GrossAmount>
                  <VariableTaxSteeringInput>

                     <ConsignorCountry/>
                     <ConsignorState/>

                     <ConsignorBusinessUnitCode/>

                     <ConsignorBusinessUnitType/>

                     <ConsigneeCountry/>

                     <ConsigneeState/>

                     <ConsigneeBusinessUnitCode/>

                     <ConsigneeBusinessUnitType/>

                     <CarrierCountry/>

                     <CarrierState/>

                     <CarrierBusinessUnitCode/>

                     <CarrierBusinessUnitType/>

                     <ShipmentStartCountry/>

                     <ShipmentEndCountry/>

                     <ShipmentStartState/>

                     <ShipmentEndState/>

                     <ServiceRenderedCountry/>

                     <ServiceRenderedState/>

                     <ResalePurpose/>

                     <IsOutBonded/>

                     <IsInBonded/>

                     <TaxPreAlgorithmOutput>

                        <IsExport/>

                        <IsImport/>

                        <IsExported/>

                        <IsImported/>

                     </TaxPreAlgorithmOutput>

                     <ShippingOfCustomsClearedGoods/>

                  </VariableTaxSteeringInput>
               </TaxInvoiceLine>

            </TaxDecisionSet>
            <TaxDate>
               <TaxAlgorithmDate>2014-03-01</TaxAlgorithmDate>
               <TaxCalculationDate/>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>N</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry>NL</ConsignorCountry>
               <ConsignorState/>
               <ConsignorBusinessUnitCode>5100</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
               <ConsigneeCountry>NL</ConsigneeCountry>
               <ConsigneeState/>
               <ConsigneeBusinessUnitCode>4960</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
               <CarrierCountry/>
               <CarrierState/>
               <CarrierBusinessUnitCode/>
               <CarrierBusinessUnitType/>
               <ShipmentStartCountry/>
               <ShipmentEndCountry/>
               <ShipmentStartState/>
               <ShipmentEndState/>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose>N</ResalePurpose>
               <IsOutBonded>N</IsOutBonded>
               <IsInBonded>N</IsInBonded>
               <TaxPreAlgorithmOutput>
                  <IsExport>Y</IsExport>
                  <IsImport>N</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>N</IsImported>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods/>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>5100</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode>RO</CountryCode>
                     <StateCode/>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
	              <CustomerID/>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>4960</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode/>
                     <StateCode/>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
            </SellerParty>
         </arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>